/*--------------------------------------*-
文件：task.c
时间：2016年3月30日
作者：HWY
版本：V1.0
-*---------------------------------------*/

#include "includes.h"


//cooperative,合作式任务	
void Task_LED_250ms    (void)
{
	//250ms任务调度一次
	P1 = (P1 + 1)%16;
}


//cooperative,合作式任务	
void  Task_Pulse_500ms  (void)
{
	//400ms任务调度一次
	SendOneByte('V');   //通过 串口发生数据给上位机
}

//reemptive,抢占式任务
void  Task_Pulse_Button  (void)
{

		/*这里可以添加自己的代码*/
}

/*------------------------------------------------------------------*-
-*--------------------     END OF FILE     ---------------------------
-*------------------------------------------------------------------*/