/*-----------------------------------------------*-
文件：	main.c
时间：2016年3月30日
作者：HWY
版本：V1.0

说明：OS根据  “司海瑞_NUAA”的V1.45版本修改而来
MCU选型:ROM最好大于4K，如STC89C52其ROM为8K
-*-----------------------------------------------*/

#include "includes.h"   

void main(void)
{
	SCH_Init_T0_UART();	            //同时初始化定时器和UART


  /*================================================================
								请在以下用户任务添加区添加相关任务函数	
	
	添加任务格式为：
	SCH_Add_Task(Func_name, DELAY_ms, PERIOD_ticks, PREEMPTIVE_EN)
	Func_name：任务函数名
	DELAY_ms：从T0启动定时开始,到第一次执行该任务所需要等待的时间(单位ms)
	PERIOD_ticks：时标间隔，表示该任务每隔多少个时标执行一次
	(一个时标间隔TICKS_TIME_MS为多少个ms，由用户在config.h中自定义,#define T0_TICK_TIME_MS  1)
	REEMPTIVE_EN：抢占式任务优先级
	======================================================================
	*/

	SCH_Add_Task (Task_LED_250ms,      0,     10,  0);  // cooperative,合作式任务	
	SCH_Add_Task (Task_Pulse_500ms,     0,     20, 0);  // cooperative,合作式任务		
//	CH_Add_Task (Task_Pulse_Button,    0,    10,  1);  // reemptive,抢占式任务	


	 
	/*启动开始任务调度*/
	SCH_Start_Tasks();  //一旦启动多任务调度将永不返回

}


/*------------------------------------------------------------------------------------------------

建议代码阅读顺序：config.h  SCH51.h  SCH51.C  main.c  T0_init.h  T0_init.c  TASK.h  task.c 

系统默认启动串口1，默认为5个任务(可自己添加删除)，前四个为合作式任务，最后一个为抢占式任务，
TICKS_TIME_MS为任务调度的单位时间，默认为50ms，在config.h中更改。

-------------------------------------------------------------------------------------------------*/



